app/controllers/answers_controller.rb

  def index
    @question = Question.find(params[:question_id])
    # @answers = @question.answers.order(best: :desc, created_at: :desc)
    @answers = @question.answers.order(created_at: :desc)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1 ORDER BY "answers"."created_at" DESC  [["question_id", 1]]

  def create
    @question = Question.find(params[:question_id])
    @answer = Answer.new(answer_params)
    @answer.question = @question

    if @answer.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("description", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @answer = Answer.find(params[:id])
    @question = @answer.question

    @question.answers.each do |answer|
      answer.best = false
      answer.save
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]
UPDATE "answers" SET "best" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["best", true], ["updated_at", 2017-07-12 15:24:19 UTC], ["id", 1]]