app/controllers/questions_controller.rb

  def index
    @questions = Question.all.order(created_at: :desc)
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

  def create
    @question = Question.new(question_params)

    if @question.save
---
INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @question = Question.find(params[:id])

    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "title" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["title", "FoobarFoobarFoobarFoobarFoobarFoobarFoobarFoobarFoobar"], ["updated_at", 2017-07-12 23:46:28 UTC], ["id", 2]]

  def destroy
    @question = Question.find(params[:id])
    if @question.destroy!
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]